package ru.mirea.task3;

public class TestBook {
    public static void main(String[] args){
        Book[] books = new Book[5];
        books[0]=new Book("Кнут Дональд Эрвин","Искусство программирования. Том 1. Основные алгоритмы",
                "Вильямс", "978-5-907144-23-1", 2019);
        books[1] = new Book("Штайн Клиффорд, Ривест Рональд Л.","Алгоритмы. Построение и анализ",
                "Вильямс", "978-5-907114-11-1", 2020);
        books[2]=new Book("Ритчи Деннис М., Керниган Брайан","Язык программирования C",
                "Диалектика", "978-5-907144-14-9", 2020);
        books[3] = new Book("Джейсон Бриггс", "Python для детей", "МИФ",
                "9785001006169", 2013);
        books[4] = new Book("Шилдт Герберт","Java. Руководство для начинающих","Диалектика",
                "978-5-6041394-5-5",2018 );
        java.util.Arrays.sort(books);
        for(Book b: books)
            System.out.println(b+"\n");
    }
}
